zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_DCM_GPR.h
#define DCM_GPR_DCMROD5_CM7_2_DCDATA_ECC_ERR_MASK (0x2000000U)
#define DCM_GPR_DCMROD5_CM7_2_DCDATA_ECC_ERR_SHIFT (25U)
#define DCM_GPR_DCMROD5_CM7_2_DCDATA_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_DCDATA_ECC_ERR(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_DCDATA_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_DCDATA_ECC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_2_DCTAG_ECC_ERR_MASK (0x4000000U)
#define DCM_GPR_DCMROD5_CM7_2_DCTAG_ECC_ERR_SHIFT (26U)
#define DCM_GPR_DCMROD5_CM7_2_DCTAG_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_DCTAG_ECC_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_DCTAG_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_DCTAG_ECC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_2_ICDATA_ECC_ERR_MASK (0x8000000U)
#define DCM_GPR_DCMROD5_CM7_2_ICDATA_ECC_ERR_SHIFT (27U)
#define DCM_GPR_DCMROD5_CM7_2_ICDATA_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_ICDATA_ECC_ERR(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_ICDATA_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_ICDATA_ECC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_2_ICTAG_ECC_ERR_MASK (0x10000000U)
#define DCM_GPR_DCMROD5_CM7_2_ICTAG_ECC_ERR_SHIFT (28U)
#define DCM_GPR_DCMROD5_CM7_2_ICTAG_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_ICTAG_ECC_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_ICTAG_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_ICTAG_ECC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_2_ITCM_ECC_ERR_MASK  (0x20000000U)
#define DCM_GPR_DCMROD5_CM7_2_ITCM_ECC_ERR_SHIFT (29U)
#define DCM_GPR_DCMROD5_CM7_2_ITCM_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_ITCM_ECC_ERR(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_ITCM_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_ITCM_ECC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_2_DTCM0_ECC_ERR_MASK (0x40000000U)
#define DCM_GPR_DCMROD5_CM7_2_DTCM0_ECC_ERR_SHIFT (30U)
#define DCM_GPR_DCMROD5_CM7_2_DTCM0_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_DTCM0_ECC_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_DTCM0_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_DTCM0_ECC_ERR_MASK)

#define DCM_GPR_DCMROD5_CM7_2_DTCM1_ECC_ERR_MASK (0x80000000U)
#define DCM_GPR_DCMROD5_CM7_2_DTCM1_ECC_ERR_SHIFT (31U)
#define DCM_GPR_DCMROD5_CM7_2_DTCM1_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD5_CM7_2_DTCM1_ECC_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD5_CM7_2_DTCM1_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD5_CM7_2_DTCM1_ECC_ERR_MASK)
/*! @} */

/*! @name DCMROD6 - Read-Only GPR On Destructive Reset 6 */
/*! @{ */

#define DCM_GPR_DCMROD6_QSPI_FLASHA_ECC_ERR_MASK (0x8U)
#define DCM_GPR_DCMROD6_QSPI_FLASHA_ECC_ERR_SHIFT (3U)
#define DCM_GPR_DCMROD6_QSPI_FLASHA_ECC_ERR_WIDTH (1U)
#define DCM_GPR_DCMROD6_QSPI_FLASHA_ECC_ERR(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_QSPI_FLASHA_ECC_ERR_SHIFT)) & DCM_GPR_DCMROD6_QSPI_FLASHA_ECC_ERR_MASK)

#define DCM_GPR_DCMROD6_AIPS0_GSKT_ALARM_MASK    (0x4000000U)
#define DCM_GPR_DCMROD6_AIPS0_GSKT_ALARM_SHIFT   (26U)
#define DCM_GPR_DCMROD6_AIPS0_GSKT_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD6_AIPS0_GSKT_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_AIPS0_GSKT_ALARM_SHIFT)) & DCM_GPR_DCMROD6_AIPS0_GSKT_ALARM_MASK)

#define DCM_GPR_DCMROD6_TCM_PRAM_AXBS_ALARM_MASK (0x40000000U)
#define DCM_GPR_DCMROD6_TCM_PRAM_AXBS_ALARM_SHIFT (30U)
#define DCM_GPR_DCMROD6_TCM_PRAM_AXBS_ALARM_WIDTH (1U)
#define DCM_GPR_DCMROD6_TCM_PRAM_AXBS_ALARM(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD6_TCM_PRAM_AXBS_ALARM_SHIFT)) & DCM_GPR_DCMROD6_TCM_PRAM_AXBS_ALARM_MASK)
/*! @} */

/*! @name DCMROD7 - Read-Only GPR On Destructive Reset 7 */
/*! @{ */

#define DCM_GPR_DCMROD7_VDD1P1_GNG2_ERR_MASK     (0x800U)
#define DCM_GPR_DCMROD7_VDD1P1_GNG2_ERR_SHIFT    (11U)
#define DCM_GPR_DCMROD7_VDD1P1_GNG2_ERR_WIDTH    (1U)
#define DCM_GPR_DCMROD7_VDD1P1_GNG2_ERR(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_VDD1P1_GNG2_ERR_SHIFT)) & DCM_GPR_DCMROD7_VDD1P1_GNG2_ERR_MASK)

#define DCM_GPR_DCMROD7_VDD2P5_GNG2_ERR_MASK     (0x1000U)
#define DCM_GPR_DCMROD7_VDD2P5_GNG2_ERR_SHIFT    (12U)
#define DCM_GPR_DCMROD7_VDD2P5_GNG2_ERR_WIDTH    (1U)
#define DCM_GPR_DCMROD7_VDD2P5_GNG2_ERR(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_VDD2P5_GNG2_ERR_SHIFT)) & DCM_GPR_DCMROD7_VDD2P5_GNG2_ERR_MASK)

#define DCM_GPR_DCMROD7_CM7_0_AHBS_ALARM_MASK    (0x10000000U)
#define DCM_GPR_DCMROD7_CM7_0_AHBS_ALARM_SHIFT   (28U)
#define DCM_GPR_DCMROD7_CM7_0_AHBS_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD7_CM7_0_AHBS_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_CM7_0_AHBS_ALARM_SHIFT)) & DCM_GPR_DCMROD7_CM7_0_AHBS_ALARM_MASK)

#define DCM_GPR_DCMROD7_CM7_2_AHBS_ALARM_MASK    (0x40000000U)
#define DCM_GPR_DCMROD7_CM7_2_AHBS_ALARM_SHIFT   (30U)
#define DCM_GPR_DCMROD7_CM7_2_AHBS_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD7_CM7_2_AHBS_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD7_CM7_2_AHBS_ALARM_SHIFT)) & DCM_GPR_DCMROD7_CM7_2_AHBS_ALARM_MASK)
/*! @} */

/*! @name DCMROD8 - Read-Only GPR On Destructive Reset Register */
/*! @{ */

#define DCM_GPR_DCMROD8_PRAM0_GSKT_ALARM_MASK    (0x1U)
#define DCM_GPR_DCMROD8_PRAM0_GSKT_ALARM_SHIFT   (0U)
#define DCM_GPR_DCMROD8_PRAM0_GSKT_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD8_PRAM0_GSKT_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_PRAM0_GSKT_ALARM_SHIFT)) & DCM_GPR_DCMROD8_PRAM0_GSKT_ALARM_MASK)

#define DCM_GPR_DCMROD8_PRAM1_GSKT_ALARM_MASK    (0x2U)
#define DCM_GPR_DCMROD8_PRAM1_GSKT_ALARM_SHIFT   (1U)
#define DCM_GPR_DCMROD8_PRAM1_GSKT_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD8_PRAM1_GSKT_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_PRAM1_GSKT_ALARM_SHIFT)) & DCM_GPR_DCMROD8_PRAM1_GSKT_ALARM_MASK)

#define DCM_GPR_DCMROD8_PRAM2_TCM_GSKT_ALARM_MASK (0x4U)
#define DCM_GPR_DCMROD8_PRAM2_TCM_GSKT_ALARM_SHIFT (2U)
#define DCM_GPR_DCMROD8_PRAM2_TCM_GSKT_ALARM_WIDTH (1U)
#define DCM_GPR_DCMROD8_PRAM2_TCM_GSKT_ALARM(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_PRAM2_TCM_GSKT_ALARM_SHIFT)) & DCM_GPR_DCMROD8_PRAM2_TCM_GSKT_ALARM_MASK)

#define DCM_GPR_DCMROD8_PRAM2_GSKT_ALARM_MASK    (0x8U)
#define DCM_GPR_DCMROD8_PRAM2_GSKT_ALARM_SHIFT   (3U)
#define DCM_GPR_DCMROD8_PRAM2_GSKT_ALARM_WIDTH   (1U)
#define DCM_GPR_DCMROD8_PRAM2_GSKT_ALARM(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROD8_PRAM2_GSKT_ALARM_SHIFT)) & DCM_GPR_DCMROD8_PRAM2_GSKT_ALARM_MASK)
/*! @} */

/*! @name DCMROF1 - Read-Only GPR On Functional Reset 1 */
/*! @{ */

