zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_DCM_GPR.h
#define DCM_GPR_DCMRWD5_DMA_RDATA_EDC_ERR_EN_MASK (0x20000U)
#define DCM_GPR_DCMRWD5_DMA_RDATA_EDC_ERR_EN_SHIFT (17U)
#define DCM_GPR_DCMRWD5_DMA_RDATA_EDC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_DMA_RDATA_EDC_ERR_EN(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_DMA_RDATA_EDC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_DMA_RDATA_EDC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD5_CM7_0_AHBP_RDATA_EDC_ERR_EN_MASK (0x100000U)
#define DCM_GPR_DCMRWD5_CM7_0_AHBP_RDATA_EDC_ERR_EN_SHIFT (20U)
#define DCM_GPR_DCMRWD5_CM7_0_AHBP_RDATA_EDC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_CM7_0_AHBP_RDATA_EDC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_CM7_0_AHBP_RDATA_EDC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_CM7_0_AHBP_RDATA_EDC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD5_CM7_0_AHBM_RDATA_EDC_ERR_EN_MASK (0x200000U)
#define DCM_GPR_DCMRWD5_CM7_0_AHBM_RDATA_EDC_ERR_EN_SHIFT (21U)
#define DCM_GPR_DCMRWD5_CM7_0_AHBM_RDATA_EDC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_CM7_0_AHBM_RDATA_EDC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_CM7_0_AHBM_RDATA_EDC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_CM7_0_AHBM_RDATA_EDC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD5_CM7_2_AHBP_RDATA_EDC_ERR_EN_MASK (0x800000U)
#define DCM_GPR_DCMRWD5_CM7_2_AHBP_RDATA_EDC_ERR_EN_SHIFT (23U)
#define DCM_GPR_DCMRWD5_CM7_2_AHBP_RDATA_EDC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_CM7_2_AHBP_RDATA_EDC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_CM7_2_AHBP_RDATA_EDC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_CM7_2_AHBP_RDATA_EDC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD5_CM7_2_AHBM_RDATA_EDC_ERR_EN_MASK (0x1000000U)
#define DCM_GPR_DCMRWD5_CM7_2_AHBM_RDATA_EDC_ERR_EN_SHIFT (24U)
#define DCM_GPR_DCMRWD5_CM7_2_AHBM_RDATA_EDC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_CM7_2_AHBM_RDATA_EDC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_CM7_2_AHBM_RDATA_EDC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_CM7_2_AHBM_RDATA_EDC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD5_CM7_2_DCDATA_ECC_ERR_EN_MASK (0x2000000U)
#define DCM_GPR_DCMRWD5_CM7_2_DCDATA_ECC_ERR_EN_SHIFT (25U)
#define DCM_GPR_DCMRWD5_CM7_2_DCDATA_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_CM7_2_DCDATA_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_CM7_2_DCDATA_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_CM7_2_DCDATA_ECC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD5_CM7_2_DCTAG_ECC_ERR_EN_MASK (0x4000000U)
#define DCM_GPR_DCMRWD5_CM7_2_DCTAG_ECC_ERR_EN_SHIFT (26U)
#define DCM_GPR_DCMRWD5_CM7_2_DCTAG_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_CM7_2_DCTAG_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_CM7_2_DCTAG_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_CM7_2_DCTAG_ECC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD5_CM7_2_ICDATA_ECC_ERR_EN_MASK (0x8000000U)
#define DCM_GPR_DCMRWD5_CM7_2_ICDATA_ECC_ERR_EN_SHIFT (27U)
#define DCM_GPR_DCMRWD5_CM7_2_ICDATA_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_CM7_2_ICDATA_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_CM7_2_ICDATA_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_CM7_2_ICDATA_ECC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD5_CM7_2_ICTAG_ECC_ERR_EN_MASK (0x10000000U)
#define DCM_GPR_DCMRWD5_CM7_2_ICTAG_ECC_ERR_EN_SHIFT (28U)
#define DCM_GPR_DCMRWD5_CM7_2_ICTAG_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_CM7_2_ICTAG_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_CM7_2_ICTAG_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_CM7_2_ICTAG_ECC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD5_CM7_2_ITCM_ECC_ERR_EN_MASK (0x20000000U)
#define DCM_GPR_DCMRWD5_CM7_2_ITCM_ECC_ERR_EN_SHIFT (29U)
#define DCM_GPR_DCMRWD5_CM7_2_ITCM_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_CM7_2_ITCM_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_CM7_2_ITCM_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_CM7_2_ITCM_ECC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD5_CM7_2_DTCM0_ECC_ERR_EN_MASK (0x40000000U)
#define DCM_GPR_DCMRWD5_CM7_2_DTCM0_ECC_ERR_EN_SHIFT (30U)
#define DCM_GPR_DCMRWD5_CM7_2_DTCM0_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_CM7_2_DTCM0_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_CM7_2_DTCM0_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_CM7_2_DTCM0_ECC_ERR_EN_MASK)

#define DCM_GPR_DCMRWD5_CM7_2_DTCM1_ECC_ERR_EN_MASK (0x80000000U)
#define DCM_GPR_DCMRWD5_CM7_2_DTCM1_ECC_ERR_EN_SHIFT (31U)
#define DCM_GPR_DCMRWD5_CM7_2_DTCM1_ECC_ERR_EN_WIDTH (1U)
#define DCM_GPR_DCMRWD5_CM7_2_DTCM1_ECC_ERR_EN(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD5_CM7_2_DTCM1_ECC_ERR_EN_SHIFT)) & DCM_GPR_DCMRWD5_CM7_2_DTCM1_ECC_ERR_EN_MASK)
/*! @} */

/*! @name DCMRWD6 - Read Write GPR On Destructive Reset 6 */
/*! @{ */

#define DCM_GPR_DCMRWD6_EDMA_DBG_DIS_CM7_0_MASK  (0x1U)
#define DCM_GPR_DCMRWD6_EDMA_DBG_DIS_CM7_0_SHIFT (0U)
#define DCM_GPR_DCMRWD6_EDMA_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD6_EDMA_DBG_DIS_CM7_0(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD6_EDMA_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD6_EDMA_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD6_FCCU_DBG_DIS_CM7_0_MASK  (0x2U)
#define DCM_GPR_DCMRWD6_FCCU_DBG_DIS_CM7_0_SHIFT (1U)
#define DCM_GPR_DCMRWD6_FCCU_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD6_FCCU_DBG_DIS_CM7_0(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD6_FCCU_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD6_FCCU_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD6_LCU0_DBG_DIS_CM7_0_MASK  (0x4U)
#define DCM_GPR_DCMRWD6_LCU0_DBG_DIS_CM7_0_SHIFT (2U)
#define DCM_GPR_DCMRWD6_LCU0_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD6_LCU0_DBG_DIS_CM7_0(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD6_LCU0_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD6_LCU0_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD6_LCU1_DBG_DIS_CM7_0_MASK  (0x8U)
#define DCM_GPR_DCMRWD6_LCU1_DBG_DIS_CM7_0_SHIFT (3U)
#define DCM_GPR_DCMRWD6_LCU1_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD6_LCU1_DBG_DIS_CM7_0(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD6_LCU1_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD6_LCU1_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD6_EMIOS0_DBG_DIS_CM7_0_MASK (0x10U)
#define DCM_GPR_DCMRWD6_EMIOS0_DBG_DIS_CM7_0_SHIFT (4U)
#define DCM_GPR_DCMRWD6_EMIOS0_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD6_EMIOS0_DBG_DIS_CM7_0(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD6_EMIOS0_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD6_EMIOS0_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD6_EMIOS1_DBG_DIS_CM7_0_MASK (0x20U)
#define DCM_GPR_DCMRWD6_EMIOS1_DBG_DIS_CM7_0_SHIFT (5U)
#define DCM_GPR_DCMRWD6_EMIOS1_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD6_EMIOS1_DBG_DIS_CM7_0(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD6_EMIOS1_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD6_EMIOS1_DBG_DIS_CM7_0_MASK)

