zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_DCM_GPR.h
/*! @name DCMRWD12 - Read Write GPR On Destructive Reset 12 */
/*! @{ */

#define DCM_GPR_DCMRWD12_EDMA_DBG_DIS_CM7_2_MASK (0x1U)
#define DCM_GPR_DCMRWD12_EDMA_DBG_DIS_CM7_2_SHIFT (0U)
#define DCM_GPR_DCMRWD12_EDMA_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_EDMA_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_EDMA_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_EDMA_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_FCCU_DBG_DIS_CM7_2_MASK (0x2U)
#define DCM_GPR_DCMRWD12_FCCU_DBG_DIS_CM7_2_SHIFT (1U)
#define DCM_GPR_DCMRWD12_FCCU_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_FCCU_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_FCCU_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_FCCU_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_LCU0_DBG_DIS_CM7_2_MASK (0x4U)
#define DCM_GPR_DCMRWD12_LCU0_DBG_DIS_CM7_2_SHIFT (2U)
#define DCM_GPR_DCMRWD12_LCU0_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_LCU0_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_LCU0_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_LCU0_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_LCU1_DBG_DIS_CM7_2_MASK (0x8U)
#define DCM_GPR_DCMRWD12_LCU1_DBG_DIS_CM7_2_SHIFT (3U)
#define DCM_GPR_DCMRWD12_LCU1_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_LCU1_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_LCU1_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_LCU1_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_eMIOS0_DBG_DIS_CM7_2_MASK (0x10U)
#define DCM_GPR_DCMRWD12_eMIOS0_DBG_DIS_CM7_2_SHIFT (4U)
#define DCM_GPR_DCMRWD12_eMIOS0_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_eMIOS0_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_eMIOS0_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_eMIOS0_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_eMIOS1_DBG_DIS_CM7_2_MASK (0x20U)
#define DCM_GPR_DCMRWD12_eMIOS1_DBG_DIS_CM7_2_SHIFT (5U)
#define DCM_GPR_DCMRWD12_eMIOS1_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_eMIOS1_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_eMIOS1_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_eMIOS1_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_eMIOS2_DBG_DIS_CM7_2_MASK (0x40U)
#define DCM_GPR_DCMRWD12_eMIOS2_DBG_DIS_CM7_2_SHIFT (6U)
#define DCM_GPR_DCMRWD12_eMIOS2_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_eMIOS2_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_eMIOS2_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_eMIOS2_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_RTC_DBG_DIS_CM7_2_MASK  (0x80U)
#define DCM_GPR_DCMRWD12_RTC_DBG_DIS_CM7_2_SHIFT (7U)
#define DCM_GPR_DCMRWD12_RTC_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_RTC_DBG_DIS_CM7_2(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_RTC_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_RTC_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_SWT0_DBG_DIS_CM7_2_MASK (0x100U)
#define DCM_GPR_DCMRWD12_SWT0_DBG_DIS_CM7_2_SHIFT (8U)
#define DCM_GPR_DCMRWD12_SWT0_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_SWT0_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_SWT0_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_SWT0_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_STM0_DBG_DIS_CM7_2_MASK (0x400U)
#define DCM_GPR_DCMRWD12_STM0_DBG_DIS_CM7_2_SHIFT (10U)
#define DCM_GPR_DCMRWD12_STM0_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_STM0_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_STM0_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_STM0_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_STM1_DBG_DIS_CM7_2_MASK (0x800U)
#define DCM_GPR_DCMRWD12_STM1_DBG_DIS_CM7_2_SHIFT (11U)
#define DCM_GPR_DCMRWD12_STM1_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_STM1_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_STM1_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_STM1_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_PIT0_DBG_DIS_CM7_2_MASK (0x1000U)
#define DCM_GPR_DCMRWD12_PIT0_DBG_DIS_CM7_2_SHIFT (12U)
#define DCM_GPR_DCMRWD12_PIT0_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_PIT0_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_PIT0_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_PIT0_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_PIT1_DBG_DIS_CM7_2_MASK (0x2000U)
#define DCM_GPR_DCMRWD12_PIT1_DBG_DIS_CM7_2_SHIFT (13U)
#define DCM_GPR_DCMRWD12_PIT1_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_PIT1_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_PIT1_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_PIT1_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_PIT2_DBG_DIS_CM7_2_MASK (0x4000U)
#define DCM_GPR_DCMRWD12_PIT2_DBG_DIS_CM7_2_SHIFT (14U)
#define DCM_GPR_DCMRWD12_PIT2_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_PIT2_DBG_DIS_CM7_2(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_PIT2_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_PIT2_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_LPSPI0_DBG_DIS_CM7_2_MASK (0x8000U)
#define DCM_GPR_DCMRWD12_LPSPI0_DBG_DIS_CM7_2_SHIFT (15U)
#define DCM_GPR_DCMRWD12_LPSPI0_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_LPSPI0_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_LPSPI0_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_LPSPI0_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_LPSPI1_DBG_DIS_CM7_2_MASK (0x10000U)
#define DCM_GPR_DCMRWD12_LPSPI1_DBG_DIS_CM7_2_SHIFT (16U)
#define DCM_GPR_DCMRWD12_LPSPI1_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_LPSPI1_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_LPSPI1_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_LPSPI1_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_LPSPI2_DBG_DIS_CM7_2_MASK (0x20000U)
#define DCM_GPR_DCMRWD12_LPSPI2_DBG_DIS_CM7_2_SHIFT (17U)
#define DCM_GPR_DCMRWD12_LPSPI2_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_LPSPI2_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_LPSPI2_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_LPSPI2_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_LPSPI3_DBG_DIS_CM7_2_MASK (0x40000U)
#define DCM_GPR_DCMRWD12_LPSPI3_DBG_DIS_CM7_2_SHIFT (18U)
#define DCM_GPR_DCMRWD12_LPSPI3_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_LPSPI3_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_LPSPI3_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_LPSPI3_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_LPSPI4_DBG_DIS_CM7_2_MASK (0x80000U)
#define DCM_GPR_DCMRWD12_LPSPI4_DBG_DIS_CM7_2_SHIFT (19U)
#define DCM_GPR_DCMRWD12_LPSPI4_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_LPSPI4_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_LPSPI4_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_LPSPI4_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_LPSPI5_DBG_DIS_CM7_2_MASK (0x100000U)
#define DCM_GPR_DCMRWD12_LPSPI5_DBG_DIS_CM7_2_SHIFT (20U)
#define DCM_GPR_DCMRWD12_LPSPI5_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_LPSPI5_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_LPSPI5_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_LPSPI5_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_LPI2C0_DBG_DIS_CM7_2_MASK (0x200000U)
#define DCM_GPR_DCMRWD12_LPI2C0_DBG_DIS_CM7_2_SHIFT (21U)
#define DCM_GPR_DCMRWD12_LPI2C0_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_LPI2C0_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_LPI2C0_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_LPI2C0_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_LPI2C1_DBG_DIS_CM7_2_MASK (0x400000U)
#define DCM_GPR_DCMRWD12_LPI2C1_DBG_DIS_CM7_2_SHIFT (22U)
#define DCM_GPR_DCMRWD12_LPI2C1_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_LPI2C1_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_LPI2C1_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_LPI2C1_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_FLEXIO_DBG_DIS_CM7_2_MASK (0x800000U)
#define DCM_GPR_DCMRWD12_FLEXIO_DBG_DIS_CM7_2_SHIFT (23U)
#define DCM_GPR_DCMRWD12_FLEXIO_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_FLEXIO_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_FLEXIO_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_FLEXIO_DBG_DIS_CM7_2_MASK)

#define DCM_GPR_DCMRWD12_FLEXCAN0_DBG_DIS_CM7_2_MASK (0x1000000U)
#define DCM_GPR_DCMRWD12_FLEXCAN0_DBG_DIS_CM7_2_SHIFT (24U)
#define DCM_GPR_DCMRWD12_FLEXCAN0_DBG_DIS_CM7_2_WIDTH (1U)
#define DCM_GPR_DCMRWD12_FLEXCAN0_DBG_DIS_CM7_2(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD12_FLEXCAN0_DBG_DIS_CM7_2_SHIFT)) & DCM_GPR_DCMRWD12_FLEXCAN0_DBG_DIS_CM7_2_MASK)

