zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K358_DCM_GPR.h
#define DCM_GPR_DCMRWF2_PMOS_CTRL_GPIO_DATA_MASK (0x100U)
#define DCM_GPR_DCMRWF2_PMOS_CTRL_GPIO_DATA_SHIFT (8U)
#define DCM_GPR_DCMRWF2_PMOS_CTRL_GPIO_DATA_WIDTH (1U)
#define DCM_GPR_DCMRWF2_PMOS_CTRL_GPIO_DATA(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_PMOS_CTRL_GPIO_DATA_SHIFT)) & DCM_GPR_DCMRWF2_PMOS_CTRL_GPIO_DATA_MASK)

#define DCM_GPR_DCMRWF2_SAI_MCLK2_SEL_MASK       (0x800U)
#define DCM_GPR_DCMRWF2_SAI_MCLK2_SEL_SHIFT      (11U)
#define DCM_GPR_DCMRWF2_SAI_MCLK2_SEL_WIDTH      (1U)
#define DCM_GPR_DCMRWF2_SAI_MCLK2_SEL(x)         (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_SAI_MCLK2_SEL_SHIFT)) & DCM_GPR_DCMRWF2_SAI_MCLK2_SEL_MASK)

#define DCM_GPR_DCMRWF2_SUPPLY2_MON_EN_MASK      (0x1000U)
#define DCM_GPR_DCMRWF2_SUPPLY2_MON_EN_SHIFT     (12U)
#define DCM_GPR_DCMRWF2_SUPPLY2_MON_EN_WIDTH     (1U)
#define DCM_GPR_DCMRWF2_SUPPLY2_MON_EN(x)        (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_SUPPLY2_MON_EN_SHIFT)) & DCM_GPR_DCMRWF2_SUPPLY2_MON_EN_MASK)

#define DCM_GPR_DCMRWF2_SUPPLY2_MON_SEL_MASK     (0xE000U)
#define DCM_GPR_DCMRWF2_SUPPLY2_MON_SEL_SHIFT    (13U)
#define DCM_GPR_DCMRWF2_SUPPLY2_MON_SEL_WIDTH    (3U)
#define DCM_GPR_DCMRWF2_SUPPLY2_MON_SEL(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_SUPPLY2_MON_SEL_SHIFT)) & DCM_GPR_DCMRWF2_SUPPLY2_MON_SEL_MASK)

#define DCM_GPR_DCMRWF2_HSE_GSKT_BYPASS_MASK     (0x10000U)
#define DCM_GPR_DCMRWF2_HSE_GSKT_BYPASS_SHIFT    (16U)
#define DCM_GPR_DCMRWF2_HSE_GSKT_BYPASS_WIDTH    (1U)
#define DCM_GPR_DCMRWF2_HSE_GSKT_BYPASS(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_HSE_GSKT_BYPASS_SHIFT)) & DCM_GPR_DCMRWF2_HSE_GSKT_BYPASS_MASK)

#define DCM_GPR_DCMRWF2_PGOOD_POLARITY_MASK      (0x200000U)
#define DCM_GPR_DCMRWF2_PGOOD_POLARITY_SHIFT     (21U)
#define DCM_GPR_DCMRWF2_PGOOD_POLARITY_WIDTH     (1U)
#define DCM_GPR_DCMRWF2_PGOOD_POLARITY(x)        (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_PGOOD_POLARITY_SHIFT)) & DCM_GPR_DCMRWF2_PGOOD_POLARITY_MASK)

#define DCM_GPR_DCMRWF2_PLL1_LOL_RST_EN_MASK     (0x1000000U)
#define DCM_GPR_DCMRWF2_PLL1_LOL_RST_EN_SHIFT    (24U)
#define DCM_GPR_DCMRWF2_PLL1_LOL_RST_EN_WIDTH    (1U)
#define DCM_GPR_DCMRWF2_PLL1_LOL_RST_EN(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_PLL1_LOL_RST_EN_SHIFT)) & DCM_GPR_DCMRWF2_PLL1_LOL_RST_EN_MASK)

#define DCM_GPR_DCMRWF2_WKPU0_SRC_SELECT_MASK    (0x2000000U)
#define DCM_GPR_DCMRWF2_WKPU0_SRC_SELECT_SHIFT   (25U)
#define DCM_GPR_DCMRWF2_WKPU0_SRC_SELECT_WIDTH   (1U)
#define DCM_GPR_DCMRWF2_WKPU0_SRC_SELECT(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_WKPU0_SRC_SELECT_SHIFT)) & DCM_GPR_DCMRWF2_WKPU0_SRC_SELECT_MASK)

#define DCM_GPR_DCMRWF2_WKPU14_SRC_SELECT_MASK   (0x4000000U)
#define DCM_GPR_DCMRWF2_WKPU14_SRC_SELECT_SHIFT  (26U)
#define DCM_GPR_DCMRWF2_WKPU14_SRC_SELECT_WIDTH  (1U)
#define DCM_GPR_DCMRWF2_WKPU14_SRC_SELECT(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_WKPU14_SRC_SELECT_SHIFT)) & DCM_GPR_DCMRWF2_WKPU14_SRC_SELECT_MASK)

#define DCM_GPR_DCMRWF2_WKPU15_SRC_SELECT_MASK   (0x8000000U)
#define DCM_GPR_DCMRWF2_WKPU15_SRC_SELECT_SHIFT  (27U)
#define DCM_GPR_DCMRWF2_WKPU15_SRC_SELECT_WIDTH  (1U)
#define DCM_GPR_DCMRWF2_WKPU15_SRC_SELECT(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_WKPU15_SRC_SELECT_SHIFT)) & DCM_GPR_DCMRWF2_WKPU15_SRC_SELECT_MASK)

#define DCM_GPR_DCMRWF2_WKPU18_SRC_SELECT_MASK   (0x10000000U)
#define DCM_GPR_DCMRWF2_WKPU18_SRC_SELECT_SHIFT  (28U)
#define DCM_GPR_DCMRWF2_WKPU18_SRC_SELECT_WIDTH  (1U)
#define DCM_GPR_DCMRWF2_WKPU18_SRC_SELECT(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_WKPU18_SRC_SELECT_SHIFT)) & DCM_GPR_DCMRWF2_WKPU18_SRC_SELECT_MASK)

#define DCM_GPR_DCMRWF2_WKPU27_SRC_SELECT_MASK   (0x20000000U)
#define DCM_GPR_DCMRWF2_WKPU27_SRC_SELECT_SHIFT  (29U)
#define DCM_GPR_DCMRWF2_WKPU27_SRC_SELECT_WIDTH  (1U)
#define DCM_GPR_DCMRWF2_WKPU27_SRC_SELECT(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_WKPU27_SRC_SELECT_SHIFT)) & DCM_GPR_DCMRWF2_WKPU27_SRC_SELECT_MASK)

#define DCM_GPR_DCMRWF2_WKPU45_SRC_SELECT_MASK   (0x40000000U)
#define DCM_GPR_DCMRWF2_WKPU45_SRC_SELECT_SHIFT  (30U)
#define DCM_GPR_DCMRWF2_WKPU45_SRC_SELECT_WIDTH  (1U)
#define DCM_GPR_DCMRWF2_WKPU45_SRC_SELECT(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_WKPU45_SRC_SELECT_SHIFT)) & DCM_GPR_DCMRWF2_WKPU45_SRC_SELECT_MASK)

#define DCM_GPR_DCMRWF2_WKPU8_SRC_SELECT_MASK    (0x80000000U)
#define DCM_GPR_DCMRWF2_WKPU8_SRC_SELECT_SHIFT   (31U)
#define DCM_GPR_DCMRWF2_WKPU8_SRC_SELECT_WIDTH   (1U)
#define DCM_GPR_DCMRWF2_WKPU8_SRC_SELECT(x)      (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF2_WKPU8_SRC_SELECT_SHIFT)) & DCM_GPR_DCMRWF2_WKPU8_SRC_SELECT_MASK)
/*! @} */

/*! @name DCMRWF3 - Read Write GPR On Functional Reset 3 */
/*! @{ */

#define DCM_GPR_DCMRWF3_MAC_RX_CLK_MUX_BYPASS_MASK (0x6000U)
#define DCM_GPR_DCMRWF3_MAC_RX_CLK_MUX_BYPASS_SHIFT (13U)
#define DCM_GPR_DCMRWF3_MAC_RX_CLK_MUX_BYPASS_WIDTH (2U)
#define DCM_GPR_DCMRWF3_MAC_RX_CLK_MUX_BYPASS(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF3_MAC_RX_CLK_MUX_BYPASS_SHIFT)) & DCM_GPR_DCMRWF3_MAC_RX_CLK_MUX_BYPASS_MASK)

#define DCM_GPR_DCMRWF3_MAC_TX_CLK_MUX_BYPASS_MASK (0x8000U)
#define DCM_GPR_DCMRWF3_MAC_TX_CLK_MUX_BYPASS_SHIFT (15U)
#define DCM_GPR_DCMRWF3_MAC_TX_CLK_MUX_BYPASS_WIDTH (1U)
#define DCM_GPR_DCMRWF3_MAC_TX_CLK_MUX_BYPASS(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF3_MAC_TX_CLK_MUX_BYPASS_SHIFT)) & DCM_GPR_DCMRWF3_MAC_TX_CLK_MUX_BYPASS_MASK)
/*! @} */

/*! @name DCMRWF4 - Read Write GPR On Functional Reset 4 */
/*! @{ */

#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S8_MASK (0x2U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S8_SHIFT (1U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S8_WIDTH (1U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S8(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S8_SHIFT)) & DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S8_MASK)

#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S9_MASK (0x4U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S9_SHIFT (2U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S9_WIDTH (1U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S9(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S9_SHIFT)) & DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC0_S9_MASK)

#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S14_MASK (0x8U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S14_SHIFT (3U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S14_WIDTH (1U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S14(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S14_SHIFT)) & DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S14_MASK)

#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S15_MASK (0x10U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S15_SHIFT (4U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S15_WIDTH (1U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S15(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S15_SHIFT)) & DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S15_MASK)

#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S22_MASK (0x20U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S22_SHIFT (5U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S22_WIDTH (1U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S22(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S22_SHIFT)) & DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S22_MASK)

#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S23_MASK (0x40U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S23_SHIFT (6U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S23_WIDTH (1U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S23(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S23_SHIFT)) & DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC1_S23_MASK)

#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC2_S8_MASK (0x200U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC2_S8_SHIFT (9U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC2_S8_WIDTH (1U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC2_S8(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC2_S8_SHIFT)) & DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC2_S8_MASK)

#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC2_S9_MASK (0x400U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC2_S9_SHIFT (10U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC2_S9_WIDTH (1U)
#define DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC2_S9(x)   (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC2_S9_SHIFT)) & DCM_GPR_DCMRWF4_MUX_MODE_EN_ADC2_S9_MASK)

#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN0_BYP_MASK (0x2000U)
#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN0_BYP_SHIFT (13U)
#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN0_BYP_WIDTH (1U)
#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN0_BYP(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN0_BYP_SHIFT)) & DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN0_BYP_MASK)

#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN1_BYP_MASK (0x4000U)
#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN1_BYP_SHIFT (14U)
#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN1_BYP_WIDTH (1U)
#define DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN1_BYP(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN1_BYP_SHIFT)) & DCM_GPR_DCMRWF4_GLITCH_FIL_TRG_IN1_BYP_MASK)

